{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import json\n",
    "import os\n",
    "from rdflib import Graph, Namespace, Literal, BNode, URIRef\n",
    "from rdflib.namespace import RDF\n",
    "import glob\n",
    "import urllib.parse as up\n",
    "from graphdbfunctions import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "GRAPHDB_HOST = \"http://localhost:7200\"\n",
    "GRAPHDB_REPO = 'gentilly_cadastre' # str | The repository ID\n",
    "TTL_PATH = \"C:/Users/stual/PycharmProjects/peuplement_ontology/ontologie-peuplement/data/rdf\"\n",
    "RDF_PATH_ROOT = \"C:/Users/stual/PycharmProjects/peuplement_ontology/ontologie-peuplement/data/rdf-graph-construct\"\n",
    "ONTOLOGY_PATH = \"D:/Documents/ONTOLOGY/\"\n",
    "ONTOLOGY_MODULES = ['ontology-adresse.ttl','ontology-cadastre.ttl']\n",
    "NAMED_GRAPHS = [\"http://data.ign.fr/sources/\",\n",
    "        \"http://data.ign.fr/plots/frommaps/\",\n",
    "        \"http://data.ign.fr/plots/fromregisters/\",\n",
    "        \"http://data.ign.fr/ontology\",\n",
    "        \"http://data.ign.fr/otherslandmarks\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "MAIN_URI = \"http://rdf.geohistoricaldata.org\"\n",
    "MAPS_REGISTERS_LINKS_GRAPH = MAIN_URI + \"/id/test\"\n",
    "TMP_GRAPH = MAIN_URI + \"/id/temporaire\"\n",
    "ORDRE_GRAPH = MAIN_URI + \"/id/ordre\"\n",
    "EVENTS_CHANGES = MAIN_URI + \"/id/events_changes\"\n",
    "GRAPHS = [MAPS_REGISTERS_LINKS_GRAPH, TMP_GRAPH, ORDRE_GRAPH]\n",
    "PRINT = True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "remove_named_graphs(GRAPHDB_HOST,GRAPHDB_REPO,GRAPHS)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "prefixes = \"\"\"PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX cad_ltype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/landmarkType/>\n",
    "PREFIX cad: <http://rdf.geohistoricaldata.org/def/cadastre#>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
    "PREFIX cad_atype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/attributeType/>\n",
    "PREFIX cad_spval: <http://rdf.geohistoricaldata.org/id/codes/cadastrenap/specialCellValue/>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
    "PREFIX source: <http://rdf.geohistoricaldata.org/id/source/>\n",
    "PREFIX srctype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/sourceType/>\n",
    "PREFIX cad_etype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/eventType/>\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Create similarity links between \"maps\" plots and \"registers\" plots"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "\n",
      "INSERT {\n",
      "        GRAPH <http://data.ign.fr/id/test> {\n",
      "            ?registersLandmark add:isSimilarTo ?mapsLandmark.\n",
      "            ?mapsLandmark add:isSimilarTo ?registersLandmark.}}\n",
      "    WHERE {\n",
      "        GRAPH <http://data.ign.fr/plots/frommaps/> {\n",
      "           ?mapsLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
      "        }\n",
      "        ?registersLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
      "        ?registersLandmark add:hasAttribute ?attr1.\n",
      "        ?attr1 add:isAttributeType cad_atype:PlotMention.\n",
      "    \n",
      "        MINUS {?registersLandmark add:isSimilarTo ?mapsLandmark}\n",
      "        MINUS {?mapsLandmark add:isSimilarTo ?registersLandmark}\n",
      "        ?mapsLandmark dcterms:identifier ?plotidm.\n",
      "        ?registersLandmark dcterms:identifier ?plotidr.\n",
      "        BIND(\n",
      "             IF(STRENDS(STR(?plotidr), \"p\"), \n",
      "                SUBSTR(STR(?plotidr), 1, STRLEN(STR(?plotidr)) - 1), \n",
      "                ?plotidr\n",
      "              ) AS ?plotid\n",
      "            )\n",
      "        FILTER (?plotidm = ?plotid)\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "\n",
    "INSERT {\n",
    "        GRAPH <\"\"\" + MAPS_REGISTERS_LINKS_GRAPH + \"\"\"> {\n",
    "            ?registersLandmark add:isSimilarTo ?mapsLandmark.\n",
    "            ?mapsLandmark add:isSimilarTo ?registersLandmark.}}\n",
    "    WHERE {\n",
    "        GRAPH <http://rdf.geohistoricaldata.org/plots/frommaps/> {\n",
    "           ?mapsLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
    "        }\n",
    "        ?registersLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
    "        ?registersLandmark add:hasAttribute ?attr1.\n",
    "        ?attr1 add:isAttributeType cad_atype:PlotMention.\n",
    "    \n",
    "        MINUS {?registersLandmark add:isSimilarTo ?mapsLandmark}\n",
    "        MINUS {?mapsLandmark add:isSimilarTo ?registersLandmark}\n",
    "        ?mapsLandmark dcterms:identifier ?plotidm.\n",
    "        ?registersLandmark dcterms:identifier ?plotidr.\n",
    "        BIND(\n",
    "             IF(STRENDS(STR(?plotidr), \"p\"), \n",
    "                SUBSTR(STR(?plotidr), 1, STRLEN(STR(?plotidr)) - 1), \n",
    "                ?plotidr\n",
    "              ) AS ?plotid\n",
    "            )\n",
    "        FILTER (?plotidm = ?plotid)\n",
    "}\n",
    "\"\"\"\n",
    "if PRINT:\n",
    "  print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Calcul des écarts relatifs (en jour) entre les états de parcelles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#Export des écarts temporels entre les états des parcelles issus des matrices\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
      "\n",
      "CONSTRUCT{?mapsLandmark add:hasTimeGap [ add:hasValue ?ecart; add:isFirstRL ?registerLandmark; add:isSecondRL ?registerLandmark2]}\n",
      "    WHERE {\n",
      "    GRAPH <http://data.ign.fr/id/test> \n",
      "    {?mapsLandmark add:isSimilarTo ?registerLandmark.\n",
      "    ?mapsLandmark add:isSimilarTo ?registerLandmark2.}\n",
      "    ?registerLandmark add:hasTime/add:hasEnd/add:timeStamp ?fin.\n",
      "    ?registerLandmark2 add:hasTime/add:hasBeginning/add:timeStamp ?debut2 .\n",
      "BIND(ofn:asDays(?debut2 - ?fin) as ?ecart).\n",
      "FILTER ((?ecart > 0) && !(sameTerm(?registerLandmark,?registerLandmark2)))\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "QUERY = \"\"\"\n",
    "#Export des écarts temporels entre les états des parcelles issus des matrices\n",
    "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
    "\n",
    "CONSTRUCT{?mapsLandmark add:hasTimeGap [ add:hasValue ?ecart; add:isFirstRL ?registerLandmark; add:isSecondRL ?registerLandmark2]}\n",
    "    WHERE {\n",
    "    GRAPH <http://data.ign.fr/id/test> \n",
    "    {?mapsLandmark add:isSimilarTo ?registerLandmark.\n",
    "    ?mapsLandmark add:isSimilarTo ?registerLandmark2.}\n",
    "    ?registerLandmark add:hasTime/add:hasEnd/add:timeStamp ?fin.\n",
    "    ?registerLandmark2 add:hasTime/add:hasBeginning/add:timeStamp ?debut2 .\n",
    "BIND(ofn:asDays(?debut2 - ?fin) as ?ecart).\n",
    "FILTER ((?ecart > 0) && !(sameTerm(?registerLandmark,?registerLandmark2)))\n",
    "}\n",
    "\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "NAMED_GRAPH = TMP_GRAPH\n",
    "RDF_PATH = RDF_PATH_ROOT + \"/query-result-1.ttl\"\n",
    "load_ttl_file_into_named_graph(GRAPHDB_HOST,GRAPHDB_REPO,NAMED_GRAPH,RDF_PATH)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3. Création des relations before et after"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#Calcul des relations d'ordre temporel relatif entre états de parcelles issus des matrices\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
      "\n",
      "CONSTRUCT {?registerLandmark add:before ?registerLandmark2. ?registerLandmark2 add:after ?registerLandmark.}\n",
      "    WHERE {\n",
      "    GRAPH <http://data.ign.fr/id/temporaire> \n",
      "    {?mapsLandmark add:hasTimeGap ?gap.\n",
      "    ?gap add:hasValue ?ecart.\n",
      "    ?gap add:isFirstRL ?registerLandmark.\n",
      "    ?gap add:isSecondRL ?registerLandmark2.\n",
      "    FILTER (!sameTerm(?registerLandmark, ?registerLandmark2))\n",
      "    }} \n",
      "GROUP BY ?mapsLandmark ?registerLandmark ?registerLandmark2\n",
      "\n",
      "   \n"
     ]
    }
   ],
   "source": [
    "QUERY = \"\"\"\n",
    "#Calcul des relations d'ordre temporel relatif entre états de parcelles issus des matrices\n",
    "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
    "\n",
    "CONSTRUCT {?registerLandmark add:before ?registerLandmark2. ?registerLandmark2 add:after ?registerLandmark.}\n",
    "    WHERE {\n",
    "    GRAPH <http://data.ign.fr/id/temporaire> \n",
    "    {?mapsLandmark add:hasTimeGap ?gap.\n",
    "    ?gap add:hasValue ?ecart.\n",
    "    ?gap add:isFirstRL ?registerLandmark.\n",
    "    ?gap add:isSecondRL ?registerLandmark2.\n",
    "    FILTER (!sameTerm(?registerLandmark, ?registerLandmark2))\n",
    "    }} \n",
    "GROUP BY ?mapsLandmark ?registerLandmark ?registerLandmark2\n",
    "\n",
    "   \"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "NAMED_GRAPH = ORDRE_GRAPH\n",
    "RDF_PATH = RDF_PATH_ROOT + \"/query-result-2.ttl\"\n",
    "load_ttl_file_into_named_graph(GRAPHDB_HOST,GRAPHDB_REPO,NAMED_GRAPH,RDF_PATH)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4. Création des changements et des évènements"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX ctype: <http://rdf.geohistoricaldata.org/id/codes/address/changeType/>\n",
      "PREFIX time: <http://www.w3.org/2006/time#>\n",
      "construct {\n",
      "?registerLandmark add:changedBy ?change.\n",
      "?change a add:Change.\n",
      "?change add:appliedTo ?registerLandmark.\n",
      "?change add:isChangeType ctype:LandmarkDisappearance.\n",
      "?change add:dependsOn ?event.\n",
      "?nextPlot add:changedBy ?change2.\n",
      "?change2 a add:Change.\n",
      "?change2 add:appliedTo ?nextPlot.\n",
      "?change2 add:isChangeType ctype:LandmarkAppearance.\n",
      "?change2 add:dependsOn ?event.\n",
      "?event a add:Event.\n",
      "?event cad:isEventType cad_etype:Split.\n",
      "?event add:hasTime [ a add:TimeInstant; add:timeStamp ?datefin; add:timeCalendar time:Gregorian;\n",
      "add:timePrecision time:Year].\n",
      "}\n",
      "WHERE{\n",
      "select ?registerLandmark ?nextPlot (IRI(CONCAT(\"http://rdf.geohistoricaldata.org/id/change/\", STRUUID())) AS ?change) (IRI(CONCAT(\"http://rdf.geohistoricaldata.org/id/change/\", STRUUID())) AS ?change2) (IRI(CONCAT(\"http://rdf.geohistoricaldata.org/id/change/\", STRUUID())) AS ?event)\n",
      "where {\n",
      "    ?registerLandmark a add:Landmark.\n",
      "    ?registerLandmark add:hasTime/add:hasEnd/add:timeStamp ?datefin.\n",
      "    ?registerLandmark add:isLandmarkType cad_ltype:Plot. \n",
      "    ?registerLandmark add:hasAttribute ?attrMention.\n",
      "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
      "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
      "    ?portea cad:isSourceType srctype:FolioNonBati.\n",
      "    graph <http://data.ign.fr/id/ordre>\n",
      "    {OPTIONAL{?registerLandmark add:after ?nextPlot. }}  \n",
      "}\n",
      "GROUP BY ?registerLandmark ?nextPlot\n",
      "HAVING ((count(?portea)) > 1)\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "QUERY = \"\"\"\n",
    "PREFIX cad_etype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/eventType/>\n",
    "PREFIX cad_ltype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/landmarkType/>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
    "PREFIX cad_atype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/attributeType/>\n",
    "PREFIX cad: <http://rdf.geohistoricaldata.org/def/cadastre#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX srctype: <http://rdf.geohistoricaldata.org/id/codes/cadastre/sourceType/>\n",
    "PREFIX ctype: <http://rdf.geohistoricaldata.org/id/codes/address/changeType/>\n",
    "PREFIX time: <http://www.w3.org/2006/time#>\n",
    "construct {\n",
    "?registerLandmark add:changedBy ?change.\n",
    "?change a add:Change.\n",
    "?change add:appliedTo ?registerLandmark.\n",
    "?change add:isChangeType ctype:LandmarkDisappearance.\n",
    "?change add:dependsOn ?event.\n",
    "?nextPlot add:changedBy ?change2.\n",
    "?change2 a add:Change.\n",
    "?change2 add:appliedTo ?nextPlot.\n",
    "?change2 add:isChangeType ctype:LandmarkAppearance.\n",
    "?change2 add:dependsOn ?event.\n",
    "?event a add:Event.\n",
    "?event cad:isEventType cad_etype:Split.\n",
    "?event add:hasTime [ a add:TimeInstant; add:timeStamp ?datefin; add:timeCalendar time:Gregorian;\n",
    "add:timePrecision time:Year].\n",
    "}\n",
    "WHERE{\n",
    "select ?registerLandmark ?nextPlot (IRI(CONCAT(\"http://rdf.geohistoricaldata.org/id/change/\", STRUUID())) AS ?change) (IRI(CONCAT(\"http://rdf.geohistoricaldata.org/id/change/\", STRUUID())) AS ?change2) (IRI(CONCAT(\"http://rdf.geohistoricaldata.org/id/change/\", STRUUID())) AS ?event)\n",
    "where {\n",
    "    ?registerLandmark a add:Landmark.\n",
    "    ?registerLandmark add:hasTime/add:hasEnd/add:timeStamp ?datefin.\n",
    "    ?registerLandmark add:isLandmarkType cad_ltype:Plot. \n",
    "    ?registerLandmark add:hasAttribute ?attrMention.\n",
    "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
    "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
    "    ?portea cad:isSourceType srctype:FolioNonBati.\n",
    "    graph <http://rdf.geohistoricaldata.org/id/ordre>\n",
    "    {OPTIONAL{?registerLandmark add:after ?nextPlot. }}  \n",
    "}\n",
    "GROUP BY ?registerLandmark ?nextPlot\n",
    "HAVING ((count(?portea)) > 1)\n",
    "}\n",
    "\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "NAMED_GRAPH = EVENTS_CHANGES\n",
    "RDF_PATH = RDF_PATH_ROOT + \"/query-result-3.ttl\"\n",
    "load_ttl_file_into_named_graph(GRAPHDB_HOST,GRAPHDB_REPO,NAMED_GRAPH,RDF_PATH)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 5. Casser les liens entre les parcelles des registres qui suivent immédiatement une division et les parcelles de cartes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "QUERY = \"\"\"\n",
    "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
    "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
    "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
    "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
    "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
    "PREFIX ctype: <http://rdf.geohistoricaldata.org/id/codes/address/Type/>\n",
    "\n",
    "#Récupérer toutes les parcelles qui sont add:after une nouvelle parcelle\n",
    "#Rattacher ces parcelles à la nouvelle parcelle\n",
    "construct {\n",
    "\t?newPlot add:isSimilarTo ?registersLandmark2.\n",
    "    ?registersLandmark2 add:isSimilarTo ?newPlot.\n",
    "}\n",
    "where { \n",
    "     ?event a add:Event.\n",
    "     ?event cad:isEventType cad_etype:Split.\n",
    "     ?change add:dependsOn ?event.\n",
    "     ?change add:isChangeType ctype:LandmarkAppearance.\n",
    "     ?change add:appliedTo ?newPlot.\n",
    "    \n",
    "\t ?registersLandmark2 a add:Landmark.\n",
    "     ?registersLandmark2 add:isLandmarkType cad_ltype:Plot.\n",
    "     ?registersLandmark2 add:hasAttribute ?attr.\n",
    "     ?attr add:isAttributeType cad_atype:PlotMention.\n",
    "\n",
    "     ?registersLandmark2 (add:after*) ?newPlot.\n",
    "\n",
    "     ?change2 add:dependsOn ?event.\n",
    "     ?change2 add:isChangeType ctype:LandmarkDisappearance.\n",
    "     ?change2 add:appliedTo ?formerPlot.\n",
    "\n",
    "     ?registersLandmark2 (add:before*) ?oldPlot.\n",
    "}\n",
    "\"\"\""
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "peuplement_ontology",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
