{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 225,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import json\n",
    "import os\n",
    "from rdflib import Graph, Namespace, Literal, BNode, URIRef\n",
    "from rdflib.namespace import RDF\n",
    "import glob\n",
    "import urllib.parse as up\n",
    "from graphdbfunctions import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 226,
   "metadata": {},
   "outputs": [],
   "source": [
    "GRAPHDB_HOST = \"http://localhost:7200\"\n",
    "GRAPHDB_REPO = 'gentilly_cadastre' # str | The repository ID\n",
    "TTL_PATH = \"C:/Users/stual/PycharmProjects/peuplement_ontology/ontologie-peuplement/data/rdf\"\n",
    "ONTOLOGY_PATH = \"D:/Documents/ONTOLOGY/\"\n",
    "ONTOLOGY_MODULES = ['ontology-adresse.ttl','ontology-cadastre.ttl']\n",
    "NAMED_GRAPHS = [\"http://data.ign.fr/sources_and_owners/\",\n",
    "        \"http://data.ign.fr/plots/frommaps/\",\n",
    "        \"http://data.ign.fr/plots/fromregisters/\",\n",
    "        \"http://data.ign.fr/ontology\",\n",
    "        \"http://data.ign.fr/otherslandmarks\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 227,
   "metadata": {},
   "outputs": [],
   "source": [
    "MATRICE = \"source:94_Gentilly_MAT_NB_1848\"\n",
    "LINKS_GRAPH = \"<http://data.ign.fr/plots/cad2/>\"\n",
    "\n",
    "#MATRICE = \"source:94_Gentilly_MAT_B_NB_1813\"\n",
    "#LINKS_GRAPH = \"<http://data.ign.fr/plots/cad1/>\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 228,
   "metadata": {},
   "outputs": [],
   "source": [
    "PRINT = True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 229,
   "metadata": {},
   "outputs": [],
   "source": [
    "remove_named_graphs(GRAPHDB_HOST,GRAPHDB_REPO,['http://data.ign.fr/plots/cad2/'])\n",
    "#remove_named_graphs(GRAPHDB_HOST,GRAPHDB_REPO,['http://data.ign.fr/plots/cad1/'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 230,
   "metadata": {},
   "outputs": [],
   "source": [
    "prefixes = \"\"\"PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
    "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
    "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
    "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
    "PREFIX source: <http://data.ign.fr/id/source/>\n",
    "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
    "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Create similarity links between \"maps\" plots and \"registers\" plots"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 231,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "INSERT {\n",
      "        GRAPH <http://data.ign.fr/plots/cad2/>{\n",
      "            ?registersLandmark add:isSimilarTo ?mapsLandmark.\n",
      "            ?mapsLandmark add:isSimilarTo ?registersLandmark.}}\n",
      "    WHERE {\n",
      "        GRAPH <http://data.ign.fr/plots/frommaps/> {\n",
      "           ?mapsLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
      "        }\n",
      "        ?registersLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
      "        ?registersLandmark add:hasAttribute ?attr1.\n",
      "        ?attr1 add:isAttributeType cad_atype:PlotMention; add:hasAttributeVersion ?attrv1.\n",
      "        ?attrv1 cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn  source:94_Gentilly_MAT_NB_1848.\n",
      "    \n",
      "        MINUS {?registersLandmark add:isSimilarTo ?mapsLandmark}\n",
      "        MINUS {?mapsLandmark add:isSimilarTo ?registersLandmark}\n",
      "        ?mapsLandmark dcterms:identifier ?plotidm.\n",
      "        ?registersLandmark dcterms:identifier ?plotidr.\n",
      "        BIND(\n",
      "             IF(STRENDS(STR(?plotidr), \"p\"), \n",
      "                SUBSTR(STR(?plotidr), 1, STRLEN(STR(?plotidr)) - 1), \n",
      "                ?plotidr\n",
      "              ) AS ?plotid\n",
      "            )\n",
      "        filter(?plotidm = ?plotid)\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "INSERT {\n",
    "        GRAPH \"\"\" + LINKS_GRAPH + \"\"\"{\n",
    "            ?registersLandmark add:isSimilarTo ?mapsLandmark.\n",
    "            ?mapsLandmark add:isSimilarTo ?registersLandmark.}}\n",
    "    WHERE {\n",
    "        GRAPH <http://data.ign.fr/plots/frommaps/> {\n",
    "           ?mapsLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
    "        }\n",
    "        ?registersLandmark a add:Landmark ; add:isLandmarkType cad_ltype:Plot.\n",
    "        ?registersLandmark add:hasAttribute ?attr1.\n",
    "        ?attr1 add:isAttributeType cad_atype:PlotMention; add:hasAttributeVersion ?attrv1.\n",
    "        ?attrv1 cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn  \"\"\" + MATRICE + \"\"\".\n",
    "    \n",
    "        MINUS {?registersLandmark add:isSimilarTo ?mapsLandmark}\n",
    "        MINUS {?mapsLandmark add:isSimilarTo ?registersLandmark}\n",
    "        ?mapsLandmark dcterms:identifier ?plotidm.\n",
    "        ?registersLandmark dcterms:identifier ?plotidr.\n",
    "        BIND(\n",
    "             IF(STRENDS(STR(?plotidr), \"p\"), \n",
    "                SUBSTR(STR(?plotidr), 1, STRLEN(STR(?plotidr)) - 1), \n",
    "                ?plotidr\n",
    "              ) AS ?plotid\n",
    "            )\n",
    "        filter(?plotidm = ?plotid)\n",
    "}\n",
    "\"\"\"\n",
    "if PRINT:\n",
    "  print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 232,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Tag Event (related to PlotMention attribute) with their types"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Les articles de classements où \"Porté à\" contient au moins deux numéros folios correspondent à des divisions de parcelles (cad_etype:Split)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 233,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "INSERT {\n",
      "    GRAPH <http://data.ign.fr/plots/cad2/>{\n",
      "        ?eventEnd cad:isEventType cad_etype:Split.\n",
      "    }\n",
      "}\n",
      "WHERE {\n",
      "SELECT ?plot ?eventEnd\n",
      "WHERE {\n",
      "    ?plot a add:Landmark .\n",
      "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
      "    ?plot dcterms:identifier ?plotid .\n",
      "    ?plot add:hasAttribute ?attrMention.\n",
      "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
      "    \n",
      "    # Documents\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
      "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
      "    ?portea cad:hasNumFolio ?portealabel.\n",
      "    ?portea cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
      "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
      "    \n",
      "    # Changes and Events\n",
      "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
      "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
      "    ?changeStart add:dependsOn ?eventStart.\n",
      "    ?changeEnd add:dependsOn ?eventEnd.\n",
      "\n",
      "    # Filters\n",
      "    FILTER(?matrice = source:94_Gentilly_MAT_NB_1848)\n",
      "    }\n",
      "  GROUP BY ?plot ?eventEnd\n",
      "  HAVING(COUNT(distinct ?portea) > 1)\n",
      "  ORDER BY ?folio ?rowid\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "INSERT {\n",
    "    GRAPH \"\"\" + LINKS_GRAPH + \"\"\"{\n",
    "        ?eventEnd cad:isEventType cad_etype:Split.\n",
    "    }\n",
    "}\n",
    "WHERE {\n",
    "SELECT ?plot ?eventEnd\n",
    "WHERE {\n",
    "    ?plot a add:Landmark .\n",
    "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
    "    ?plot dcterms:identifier ?plotid .\n",
    "    ?plot add:hasAttribute ?attrMention.\n",
    "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
    "    \n",
    "    # Documents\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
    "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
    "    ?portea cad:hasNumFolio ?portealabel.\n",
    "    ?portea cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
    "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
    "    \n",
    "    # Changes and Events\n",
    "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
    "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
    "    ?changeStart add:dependsOn ?eventStart.\n",
    "    ?changeEnd add:dependsOn ?eventEnd.\n",
    "\n",
    "    # Filters\n",
    "    FILTER(?matrice = \"\"\" + MATRICE + \"\"\")\n",
    "    }\n",
    "  GROUP BY ?plot ?eventEnd\n",
    "  HAVING(COUNT(distinct ?portea) > 1)\n",
    "  ORDER BY ?folio ?rowid\n",
    "}\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 234,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Les articles de classement où \"Tiré de\" qui contiennent au moins deux numéros folios correspondent à des fusions de parcelles (cad_etype:Merge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 235,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "INSERT {\n",
      "    GRAPH <http://data.ign.fr/plots/cad2/> {\n",
      "        ?eventStart cad:isEventType cad_etype:Merge.\n",
      "    }\n",
      "}\n",
      "WHERE {\n",
      "SELECT ?plot ?eventStart\n",
      "WHERE {\n",
      "    ?plot a add:Landmark .\n",
      "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
      "    ?plot dcterms:identifier ?plotid .\n",
      "    ?plot add:hasAttribute ?attrMention.\n",
      "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
      "    \n",
      "    # Documents\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
      "    ?attrMention add:hasAttributeVersion/cad:takenFrom ?tirede.\n",
      "    ?tirede cad:hasNumFolio ?tiredelabel.\n",
      "    ?tirede cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
      "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
      "    \n",
      "    # Changes and Events\n",
      "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
      "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
      "    ?changeStart add:dependsOn ?eventStart.\n",
      "    ?changeEnd add:dependsOn ?eventEnd.\n",
      "\n",
      "    # Filters\n",
      "    FILTER(?matrice = source:94_Gentilly_MAT_NB_1848)\n",
      "    }\n",
      "  GROUP BY ?plot ?eventStart\n",
      "  HAVING(COUNT(distinct ?tirede) > 1)\n",
      "  ORDER BY ?folio ?rowid\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "INSERT {\n",
    "    GRAPH \"\"\" + LINKS_GRAPH + \"\"\" {\n",
    "        ?eventStart cad:isEventType cad_etype:Merge.\n",
    "    }\n",
    "}\n",
    "WHERE {\n",
    "SELECT ?plot ?eventStart\n",
    "WHERE {\n",
    "    ?plot a add:Landmark .\n",
    "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
    "    ?plot dcterms:identifier ?plotid .\n",
    "    ?plot add:hasAttribute ?attrMention.\n",
    "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
    "    \n",
    "    # Documents\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
    "    ?attrMention add:hasAttributeVersion/cad:takenFrom ?tirede.\n",
    "    ?tirede cad:hasNumFolio ?tiredelabel.\n",
    "    ?tirede cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
    "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
    "    \n",
    "    # Changes and Events\n",
    "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
    "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
    "    ?changeStart add:dependsOn ?eventStart.\n",
    "    ?changeEnd add:dependsOn ?eventEnd.\n",
    "\n",
    "    # Filters\n",
    "    FILTER(?matrice = \"\"\" + MATRICE + \"\"\")\n",
    "    }\n",
    "  GROUP BY ?plot ?eventStart\n",
    "  HAVING(COUNT(distinct ?tirede) > 1)\n",
    "  ORDER BY ?folio ?rowid\n",
    "}\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 236,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Les articles de classements où \"Porté à\" contient exactement un numéro de folio égal au folio de l'article correspondent à une mise à jour d'un des attributs de la parcelle sans changement d'identité."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 237,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "INSERT {\n",
      "    GRAPH <http://data.ign.fr/plots/cad2/> {\n",
      "        ?eventEnd cad:isEventType cad_etype:PropertiesUpdateInSameFolio.\n",
      "    }\n",
      "}\n",
      "WHERE {\n",
      "SELECT ?plot ?eventEnd\n",
      "WHERE {\n",
      "    ?plot a add:Landmark .\n",
      "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
      "    ?plot dcterms:identifier ?plotid .\n",
      "    ?plot add:hasAttribute ?attrMention.\n",
      "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
      "    \n",
      "    # Documents\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
      "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
      "    ?portea cad:hasNumFolio ?portealabel.\n",
      "    ?portea cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
      "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
      "    \n",
      "    # Changes and Events\n",
      "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
      "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
      "    ?changeStart add:dependsOn ?eventStart.\n",
      "    ?changeEnd add:dependsOn ?eventEnd.\n",
      "    OPTIONAL{?eventEnd cad:isEventType ?et.}\n",
      "    FILTER(!BOUND(?et) || ?et != cad_etype:Split)\n",
      "\n",
      "    # Filters\n",
      "    FILTER(?matrice = source:94_Gentilly_MAT_NB_1848)\n",
      "    FILTER(?folio = ?portea)\n",
      "    \n",
      "    }\n",
      "  GROUP BY ?plot ?eventEnd\n",
      "  HAVING(COUNT(distinct ?portea) = 1)\n",
      "  ORDER BY ?folio ?rowid\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "INSERT {\n",
    "    GRAPH \"\"\" + LINKS_GRAPH + \"\"\" {\n",
    "        ?eventEnd cad:isEventType cad_etype:PropertiesUpdateInSameFolio.\n",
    "    }\n",
    "}\n",
    "WHERE {\n",
    "SELECT ?plot ?eventEnd\n",
    "WHERE {\n",
    "    ?plot a add:Landmark .\n",
    "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
    "    ?plot dcterms:identifier ?plotid .\n",
    "    ?plot add:hasAttribute ?attrMention.\n",
    "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
    "    \n",
    "    # Documents\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
    "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
    "    ?portea cad:hasNumFolio ?portealabel.\n",
    "    ?portea cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
    "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
    "    \n",
    "    # Changes and Events\n",
    "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
    "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
    "    ?changeStart add:dependsOn ?eventStart.\n",
    "    ?changeEnd add:dependsOn ?eventEnd.\n",
    "    OPTIONAL{?eventEnd cad:isEventType ?et.}\n",
    "    FILTER(!BOUND(?et) || ?et != cad_etype:Split)\n",
    "\n",
    "    # Filters\n",
    "    FILTER(?matrice = \"\"\" + MATRICE + \"\"\")\n",
    "    FILTER(?folio = ?portea)\n",
    "    \n",
    "    }\n",
    "  GROUP BY ?plot ?eventEnd\n",
    "  HAVING(COUNT(distinct ?portea) = 1)\n",
    "  ORDER BY ?folio ?rowid\n",
    "}\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 238,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Les articles de classements où \"Porté à\" contient exactement un numéro de folio **différent** du folio de l'article correspondent à un changement de compte foncier."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 239,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "INSERT {\n",
      "    GRAPH <http://data.ign.fr/plots/cad2/> {\n",
      "        ?eventEnd cad:isEventType cad_etype:FolioChange.\n",
      "    }\n",
      "}\n",
      "WHERE {\n",
      "SELECT ?plot ?eventEnd\n",
      "WHERE {\n",
      "    ?plot a add:Landmark .\n",
      "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
      "    ?plot dcterms:identifier ?plotid .\n",
      "    ?plot add:hasAttribute ?attrMention.\n",
      "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
      "    \n",
      "    # Documents\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
      "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
      "    ?portea cad:hasNumFolio ?portealabel.\n",
      "    ?portea cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
      "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
      "    \n",
      "    # Changes and Events\n",
      "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
      "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
      "    ?changeStart add:dependsOn ?eventStart.\n",
      "    ?changeEnd add:dependsOn ?eventEnd.\n",
      "    OPTIONAL{?eventEnd cad:isEventType ?et.}\n",
      "    FILTER(!BOUND(?et) || ?et != cad_etype:Split)\n",
      "\n",
      "    # Filters\n",
      "    FILTER(?matrice = source:94_Gentilly_MAT_NB_1848)\n",
      "    FILTER(?folio != ?portea)\n",
      "    }\n",
      "  GROUP BY ?plot ?eventEnd\n",
      "  HAVING(COUNT(distinct ?portea) = 1)\n",
      "  ORDER BY ?folio ?rowid\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "INSERT {\n",
    "    GRAPH \"\"\" + LINKS_GRAPH + \"\"\" {\n",
    "        ?eventEnd cad:isEventType cad_etype:FolioChange.\n",
    "    }\n",
    "}\n",
    "WHERE {\n",
    "SELECT ?plot ?eventEnd\n",
    "WHERE {\n",
    "    ?plot a add:Landmark .\n",
    "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
    "    ?plot dcterms:identifier ?plotid .\n",
    "    ?plot add:hasAttribute ?attrMention.\n",
    "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
    "    \n",
    "    # Documents\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
    "    ?attrMention add:hasAttributeVersion/cad:passedTo ?portea.\n",
    "    ?portea cad:hasNumFolio ?portealabel.\n",
    "    ?portea cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
    "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
    "    \n",
    "    # Changes and Events\n",
    "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
    "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
    "    ?changeStart add:dependsOn ?eventStart.\n",
    "    ?changeEnd add:dependsOn ?eventEnd.\n",
    "    OPTIONAL{?eventEnd cad:isEventType ?et.}\n",
    "    FILTER(!BOUND(?et) || ?et != cad_etype:Split)\n",
    "\n",
    "    # Filters\n",
    "    FILTER(?matrice = \"\"\" + MATRICE + \"\"\")\n",
    "    FILTER(?folio != ?portea)\n",
    "    }\n",
    "  GROUP BY ?plot ?eventEnd\n",
    "  HAVING(COUNT(distinct ?portea) = 1)\n",
    "  ORDER BY ?folio ?rowid\n",
    "}\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 240,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Les articles de classements où \"Tiré de\" contient exactement **ResteSV** signifie que la parcelle a été divisée et qu'une partie reste attachée à ce compte foncier."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 241,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ltype: <http://rdf.geohistoricaldata.org/id/codes/address/landmarkType/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cad_ltype: <http://data.ign.fr/id/codes/cadastre/landmarkType/>\n",
      "PREFIX cad: <http://data.ign.fr/def/cadastre#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX add: <http://rdf.geohistoricaldata.org/def/address#>\n",
      "PREFIX cad_atype: <http://data.ign.fr/id/codes/cadastre/attributeType/>\n",
      "PREFIX cad_spval: <http://data.ign.fr/id/codes/cadastrenap/specialCellValue/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
      "PREFIX source: <http://data.ign.fr/id/source/>\n",
      "PREFIX srctype: <http://data.ign.fr/id/codes/cadastre/sourceType/>\n",
      "PREFIX cad_etype: <http://data.ign.fr/id/codes/cadastre/eventType/>\n",
      "INSERT {\n",
      "    GRAPH <http://data.ign.fr/plots/cad2/> {\n",
      "        ?eventStart cad:isEventType cad_etype:Split.\n",
      "    }\n",
      "}\n",
      "WHERE {\n",
      "SELECT ?plot ?eventStart\n",
      "WHERE {\n",
      "    ?plot a add:Landmark .\n",
      "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
      "    ?plot dcterms:identifier ?plotid .\n",
      "    ?plot add:hasAttribute ?attrMention.\n",
      "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
      "    \n",
      "    # Documents\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
      "    ?attrMention add:hasAttributeVersion/cad:takenFrom cad_spval:Reste.\n",
      "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
      "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
      "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
      "    \n",
      "    # Changes and Events\n",
      "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
      "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
      "    ?changeStart add:dependsOn ?eventStart.\n",
      "    ?changeEnd add:dependsOn ?eventEnd.\n",
      "\n",
      "    # Filters\n",
      "    FILTER(?matrice = source:94_Gentilly_MAT_NB_1848)\n",
      "    }\n",
      "  GROUP BY ?plot ?eventStart\n",
      "  HAVING(COUNT(distinct ?tirede) = 1)\n",
      "  ORDER BY ?folio ?rowid\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "QUERY = prefixes + \"\"\"\n",
    "INSERT {\n",
    "    GRAPH \"\"\" + LINKS_GRAPH + \"\"\" {\n",
    "        ?eventStart cad:isEventType cad_etype:Split.\n",
    "    }\n",
    "}\n",
    "WHERE {\n",
    "SELECT ?plot ?eventStart\n",
    "WHERE {\n",
    "    ?plot a add:Landmark .\n",
    "    ?plot add:isLandmarkType cad_ltype:Plot .\n",
    "    ?plot dcterms:identifier ?plotid .\n",
    "    ?plot add:hasAttribute ?attrMention.\n",
    "    ?attrMention add:isAttributeType cad_atype:PlotMention.\n",
    "    \n",
    "    # Documents\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+/rico:isOrWasIncludedIn ?matrice.\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?folio.\n",
    "    ?attrMention add:hasAttributeVersion/cad:takenFrom cad_spval:Reste.\n",
    "    ?folio cad:isSourceType [skos:broader+ srctype:Folio].\n",
    "    ?attrMention add:hasAttributeVersion/cad:isMentionnedIn/rico:isOrWasConstituentOf+ ?cf.\n",
    "    ?cf cad:isSourceType srctype:CompteFoncier.\n",
    "    \n",
    "    # Changes and Events\n",
    "    ?attrMention add:hasAttributeVersion/add:isMadeEffectiveBy ?changeStart.\n",
    "    ?attrMention add:hasAttributeVersion/add:isOutdatedBy ?changeEnd.\n",
    "    ?changeStart add:dependsOn ?eventStart.\n",
    "    ?changeEnd add:dependsOn ?eventEnd.\n",
    "\n",
    "    # Filters\n",
    "    FILTER(?matrice = \"\"\" + MATRICE + \"\"\")\n",
    "    }\n",
    "  GROUP BY ?plot ?eventStart\n",
    "  HAVING(COUNT(distinct ?tirede) = 1)\n",
    "  ORDER BY ?folio ?rowid\n",
    "}\"\"\"\n",
    "if PRINT:\n",
    "    print(QUERY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 242,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Response [204]> \n"
     ]
    }
   ],
   "source": [
    "update_sparql_query(GRAPHDB_HOST,GRAPHDB_REPO,QUERY)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "peuplement_ontology",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
